fio/results/ramdisk_libpmem_d32_interleave_share.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=2): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=3): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
[...]

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=25111: Mon Apr 23 10:44:07 2018
   read: IOPS=10.9M, BW=41.6GiB/s (44.7GB/s)(1248GiB/30001msec)
    clat (nsec): min=119, max=695444, avg=2503.28, stdev=1421.03
     lat (nsec): min=143, max=695482, avg=2545.51, stdev=1428.80
    clat percentiles (nsec):
     |  1.00th=[  390],  5.00th=[  462], 10.00th=[  524], 20.00th=[ 1048],
     | 30.00th=[ 1864], 40.00th=[ 2288], 50.00th=[ 2608], 60.00th=[ 2896],
     | 70.00th=[ 3184], 80.00th=[ 3536], 90.00th=[ 4080], 95.00th=[ 4576],
     | 99.00th=[ 5664], 99.50th=[ 6240], 99.90th=[11328], 99.95th=[17536],
     | 99.99th=[20608]
   bw (  KiB/s): min=177548, max=3577924, per=2.35%, avg=1024433.03, stdev=584619.03, samples=1888
   iops        : min=44387, max=894481, avg=256107.84, stdev=146154.75, samples=1888
  lat (nsec)   : 250=0.57%, 500=7.48%, 750=7.63%, 1000=3.73%
  lat (usec)   : 2=13.33%, 4=56.22%, 10=10.90%, 20=0.11%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=98.54%, sys=1.24%, ctx=888, majf=0, minf=1048784
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=327175756,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=25149: Mon Apr 23 10:44:07 2018
  write: IOPS=7971k, BW=30.4GiB/s (32.6GB/s)(912GiB/30002msec)
    clat (nsec): min=307, max=651520, avg=2557.24, stdev=3221.77
     lat (nsec): min=336, max=651567, avg=2595.25, stdev=3230.06
    clat percentiles (nsec):
     |  1.00th=[  318],  5.00th=[  322], 10.00th=[  326], 20.00th=[  330],
     | 30.00th=[  354], 40.00th=[  676], 50.00th=[ 1224], 60.00th=[ 1912],
     | 70.00th=[ 3024], 80.00th=[ 4448], 90.00th=[ 6112], 95.00th=[10048],
     | 99.00th=[14272], 99.50th=[17024], 99.90th=[21888], 99.95th=[23680],
     | 99.99th=[28544]
   bw (  KiB/s): min=135993, max=3531868, per=2.73%, avg=869744.44, stdev=835664.90, samples=1888
   iops        : min=33998, max=882967, avg=217435.77, stdev=208916.25, samples=1888
  lat (nsec)   : 500=34.65%, 750=7.21%, 1000=4.67%
  lat (usec)   : 2=14.61%, 4=14.98%, 10=18.83%, 20=4.85%, 50=0.21%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=98.96%, sys=0.99%, ctx=1550, majf=0, minf=1048833
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,239142038,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=2, jobs=32): err= 0: pid=25198: Mon Apr 23 10:44:07 2018
   read: IOPS=8635k, BW=32.9GiB/s (35.4GB/s)(989GiB/30032msec)
    clat (nsec): min=269, max=685211, avg=1836.69, stdev=1175.31
     lat (nsec): min=310, max=685273, avg=1880.63, stdev=1180.49
    clat percentiles (nsec):
     |  1.00th=[  470],  5.00th=[  556], 10.00th=[  636], 20.00th=[  804],
     | 30.00th=[ 1032], 40.00th=[ 1288], 50.00th=[ 1592], 60.00th=[ 1928],
     | 70.00th=[ 2288], 80.00th=[ 2704], 90.00th=[ 3344], 95.00th=[ 3920],
     | 99.00th=[ 5408], 99.50th=[ 6048], 99.90th=[ 7904], 99.95th=[10176],
     | 99.99th=[15680]
   bw (  KiB/s): min=165062, max=2381197, per=2.88%, avg=995057.73, stdev=348654.91, samples=1888
   iops        : min=41265, max=595299, avg=248764.03, stdev=87163.74, samples=1888
  lat (nsec)   : 500=2.33%, 750=15.03%, 1000=11.37%
  lat (usec)   : 2=33.48%, 4=33.22%, 10=4.53%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=59.68%, sys=40.02%, ctx=105408, majf=0, minf=1048819
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=259324243,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=3, jobs=32): err= 0: pid=25250: Mon Apr 23 10:44:07 2018
  write: IOPS=6689k, BW=25.5GiB/s (27.4GB/s)(766GiB/30016msec)
    clat (nsec): min=307, max=4294.2k, avg=2314.57, stdev=2786.68
     lat (nsec): min=335, max=4294.2k, avg=2355.40, stdev=2791.41
    clat percentiles (nsec):
     |  1.00th=[  314],  5.00th=[  318], 10.00th=[  318], 20.00th=[  458],
     | 30.00th=[  596], 40.00th=[  812], 50.00th=[ 1224], 60.00th=[ 1784],
     | 70.00th=[ 2576], 80.00th=[ 3760], 90.00th=[ 5536], 95.00th=[ 8256],
     | 99.00th=[12480], 99.50th=[14400], 99.90th=[20352], 99.95th=[22144],
     | 99.99th=[27264]
   bw (  KiB/s): min=67552, max=3670016, per=3.13%, avg=837969.56, stdev=647554.26, samples=1896
   iops        : min=16888, max=917504, avg=209492.34, stdev=161888.54, samples=1896
  lat (nsec)   : 500=23.29%, 750=14.39%, 1000=7.25%
  lat (usec)   : 2=18.33%, 4=18.52%, 10=15.12%, 20=2.99%, 50=0.11%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=76.57%, sys=23.07%, ctx=49936, majf=0, minf=1049146
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,200763701,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=41.6GiB/s (44.7GB/s), 41.6GiB/s-41.6GiB/s (44.7GB/s-44.7GB/s), io=1248GiB (1340GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=30.4GiB/s (32.6GB/s), 30.4GiB/s-30.4GiB/s (32.6GB/s-32.6GB/s), io=912GiB (980GB), run=30002-30002msec

Run status group 2 (all jobs):
   READ: bw=32.9GiB/s (35.4GB/s), 32.9GiB/s-32.9GiB/s (35.4GB/s-35.4GB/s), io=989GiB (1062GB), run=30032-30032msec

Run status group 3 (all jobs):
  WRITE: bw=25.5GiB/s (27.4GB/s), 25.5GiB/s-25.5GiB/s (27.4GB/s-27.4GB/s), io=766GiB (822GB), run=30016-30016msec